let versionRecord = {

   // 打包时间 2025-06-26 15:13 - 文生图 与 项目目录重构 阶段性结束
  "v16": "1.2.6",
   // 打包时间 2025-06-23 14:10 - 适配不再支持的模型，不可再发新消息
  "v15": "1.2.5",
   // 打包时间 2025-06-20 20:02 - 文生图， 我收藏列表和生成列表
  "v14": "1.2.4",
   // 打包时间 2025-06-19 19:13 - 修复工具类新建会话，已有时不让再创建；选择会话默认模型不对的问题；
  "v13": "1.2.3",
   // 打包时间 2025-06-17 20:09 - deepSearch, 分享功能分页，UI优化
  "v12": "1.2.2",
   // 打包时间 2025-06-13 17:02 - think消息体优化，备注功能，管理员列表分页，分享不限制登录可查看，消息体底部分享、复制，UI优化
  "v11": "1.2.1",
   // 打包时间 2025-06-07 09:37 - 接口前缀 chat 改为 api
  "v10": "1.2.0",
   // 打包时间 2025-06-06 18:19 - 修复新会话发首条消息，列表触发两次饿问题
  "v9": "1.1.9",
   // 打包时间 2025-06-06 16:21 - 修复工具类聊天列表接口触发两次的问题
  "v8": "1.1.8",
   // 打包时间 2025-06-06 15:32 - 完善角色删除功能
  "v7": "1.1.7",
   // 打包时间 2025-06-06 14:32 - 打包测试
  "v6": "1.1.6",
   // 打包时间 2025-06-06 14:22 - s3 地址配置
  "v5": "1.1.5",
   // 打包时间 2025-06-05 20:37 - 工具类聊天列表板块拖拽，404空页面优化，bug修复
  "v4": "1.1.4",
   // 打包时间 2025-06-05 17:40 - 补丁
  "v3": "1.1.3",
   // 打包时间 2025-06-05 17:36 - 新增会话的参数优化
  "v2": "1.1.2",
   // 打包时间 2025-06-05 14:34 - 文字工具功能，对接model选择的功能。
  "v1": "1.1.1"
}